In [31]:
import pandas as pd

In [32]:
df=pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [33]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [34]:
inputs=df.drop('Survived',axis='columns')
target=df.Survived

In [35]:
#inputs.Sex=inputs.Sex.map({'male':1,'female':2})
#inputs

we can also create dummies for SEx column

In [36]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [37]:
inputs=pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

here we can drop male column also bcz one column is enough to specify the sex

In [38]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [39]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [41]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [43]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female
0       3  22.000000   7.2500       0
1       1  38.000000  71.2833       1
2       3  26.000000   7.9250       1
3       1  35.000000  53.1000       1
4       3  35.000000   8.0500       0
5       3  29.699118   8.4583       0

In [44]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)

In [45]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [55]:
model.fit(X_train,y_train)

GaussianNB()

In [56]:
model.score(X_test,y_test)

0.7821229050279329

In [57]:
X_test[0:10]

     Pclass        Age     Fare  female
443       2  28.000000  13.0000       1
378       3  20.000000   4.0125       0
499       3  24.000000   7.7958       0
293       3  24.000000   8.8500       1
473       2  23.000000  13.7917       1
588       3  22.000000   8.0500       0
327       2  36.000000  13.0000       1
859       3  29.699118   7.2292       0
19        3  29.699118   7.2250       1
303       2  29.699118  12.3500       1

In [58]:
y_test[0:10]

443    1
378    0
499    0
293    0
473    1
588    0
327    1
859    0
19     1
303    1
Name: Survived, dtype: int64

In [59]:
model.predict(X_test[:10])

array([1, 0, 0, 1, 1, 0, 1, 0, 1, 1], dtype=int64)

In [60]:
model.predict_proba(X_test[:10])

array([[0.23607726, 0.76392274],
       [0.95847268, 0.04152732],
       [0.9624922 , 0.0375078 ],
       [0.38535037, 0.61464963],
       [0.2222337 , 0.7777663 ],
       [0.96113957, 0.03886043],
       [0.24746346, 0.75253654],
       [0.96521046, 0.03478954],
       [0.40273674, 0.59726326],
       [0.23944078, 0.76055922]])

calclate the score using cross validation

In [61]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train,y_train,cv=5)

array([0.83916084, 0.73426573, 0.74647887, 0.75352113, 0.77464789])